       01 WS-CENTER-CTRL.
          05 WS-PTR-I          PIC 99.
          05 WS-PTR-J          PIC 99.
          05 WS-LEN-TEXTO      PIC 99.
          05 WS-OFFSET         PIC 99.
          05 WS-CUALQUIER-TXT  PIC X(80).
          05 WS-TXT-CENTRADO   PIC X(80).