       FD  STOCK.
       01  STOCK-REG.
           05 STK-FECHA-ACT   PIC 9(8).    *> AAAAMMDD
           05 STK-CODIGO      PIC X(10).   *> FK Producto
           05 STK-BODEGA      PIC X(04).   *> CAMPO AGREGADO
           05 STK-MAXIMO      PIC 9(05).
           05 STK-MINIMO      PIC 9(05).
           05 STK-CANTIDAD    PIC 9(09).
           
       FD STOCK-PLANO.
       01 REG-STOCK-PLANO PIC X(200).

       FD STOCK-CSV.
       01 REG-STOCK-CSV PIC X(200).
