*> salto de linea en 8.5
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HOLAMUNDO.
 
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           CRT STATUS IS WS-KEY.
 
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-KEY          PIC 9(04).
       01  WS-OPCION       PIC X.
       
       SCREEN SECTION.
       01  PANTALLA.
           05 BLANK SCREEN.
           05 LINE 10 COL 10 VALUE "ESTE ES UN TEXTO MUY LARGO QUE VA 
       -   "A CONTINUAR EN LA LINEA DE ABAJO USANDO EL GUION".
           05 LINE 12 COL 10 VALUE "PRESIONE UNA TECLA PARA SALIR...".
 
       PROCEDURE DIVISION.
       MAIN-LOGIC.
           DISPLAY PANTALLA.
           ACCEPT WS-OPCION LINE 12 COL 45.
           STOP RUN.